Repository: ranfdev/Geopard
Catalog: po/*.po
Languages: bg, fr, hi, it, pt_br, ru, uk

source: Relax download folder permissions to fix downloads not starting
bg: Обновени са правата за достъп до папката за изтегляния, за да се поправят изтеглянията, които не започват
fr: Assouplissement de la permission d’accès au dossier Téléchargements pour corriger le problème des téléchargements ne commençant pas
hi: प्रारंभ न होने वाले डाउनलोड को ठीक करने के लिए डाउनलोड फोल्डर अनुमतियों में ढील दें
it: Rilassati i permessi della cartella degli scaricamenti per evitare che non si avviino
pt_br: Relax download As permissões de pastas para corrigir downloads não iniciando
ru: Расслабление разрешений папки загрузки для устранения не запускающихся загрузок
uk: Послаблено вимоги до каталогу завантажень, щоб виправити помилку початку завантаження

source: Improved design, with completely new pages for downloads, input requests, external links, errors
bg: Подобрен дизайн с напълно нови страници за изтегляния, заявки за въвеждане, външни връзки, грешки
fr: Conception améliorée, avec des pages entièrement nouvelles pour les téléchargements, les demandes de saisie, les liens externes et les erreurs.
hi: डाउनलोड, आगत अनुरोध, बाहरी लिंक, त्रुटियों के लिए पूरी तरह से नए पृष्ठों के साथ बेहतर अभिकल्प
it: Design migliorato, con pagine di scaricamento, richiesta di input, link esterni ed errori completamente nuove
pt_br: Design aprimorado, com páginas completamente novas para downloads, solicitações de entrada, links externos, erros
ru: Улучшенный дизайн, с совершенно новыми страницами для загрузок, запросов на ввод, внешних ссылок, ошибок
uk: Поліпшено дизайн, зокрема додано повністю нові сторінки завантажень, запитів на введення, зовнішніх посилань і помилок

source: Added more spacing between links to make them easier to click on small screens
bg: Добавено е по-голямо разстояние между връзките, за да се улесни натискането върху тях на малки екрани
fr: Ajout d’un plus grand espacement entre les liens pour faciliter le clic sur petit écran
hi: छोटी स्क्रीन पर क्लिक करना आसान बनाने के लिए लिंकों के बीच अधिक रिक्ति जोड़ी गई
it: Spaziati ulteriormente i link per renderli più facili da cliccare su schermi piccoli
pt_br: Adicionado mais espaçamento entre links para facilitar o clique em telas pequenas
ru: Добавлено большее расстояние между ссылками, чтобы их было легче нажимать на маленьких экранах
uk: Додано більше простору між посиланнями, щоб на них було легше натискати на маленьких екранах

source: Added zoom functionality, via shortcuts or directly from the popover menu
bg: Добавена е способност за мащабиране, чрез клавишни комбинации или директно от изскачащото меню
fr: Ajout de la possibilité de zoomer, via raccourcis clavier ou directement depuis le menu déroulant
hi: शॉर्टकट के माध्यम से या सीधे पॉपओवर मेनू से जूम कार्यक्षमता जोड़ी गई
it: Aggiunta funzionalità di zoom, tramite scorciatoie o direttamente da un menu flottante
pt_br: Funcionalidade de zoom adicionada, via atalhos ou diretamente do menu Popover
ru: Добавлена функция масштабирования, через комбинации клавиш или непосредственно из выпадающего меню
uk: Додано функцію масштабу скороченнями чи прямо зі спливного меню

source: Streaming button (alpha) for some audio/video file types
bg: Бутон за предаване (алфа) за някой аудио/видео типове файлове
fr: Bouton de diffusion (alpha) pour certains types de fichiers audio / vidéo
hi: कुछ ऑडियो/वीडियो फाइल प्रकारों के लिए स्ट्रीमिंग बटन (अल्फा)।
it: Pulsante per lo streaming (alpha) per alcuni tipi di file audio/video
pt_br: Botão de streaming (alfa) para alguns tipos de arquivos de áudio/vídeo
ru: Кнопка потоковой передачи (альфа) для некоторых типов аудио/видео файлов
uk: Кнопка потокового перегляду (альфа) для деяких типів аудіо- та відеофайлів

source: Changes
bg: Промени
fr: Changements
hi: बदलाव
it: Cambiamenti
pt_br: Mudanças
ru: Изменения
uk: Зміни

source: Fix downloads by granting access to download folder
bg: Поправени са изтеглянията чрез предоставяне на достъп до папката
fr: Corrections des téléchargements en permettant l’accès au dossier Téléchargements
hi: डाउनलोड फोल्डर तक अभिगम प्रदान करके डाउनलोड को ठीक किया गया
it: Risolto problema con gli scaricamenti garantendo l'accesso alla relativa cartella
pt_br: Corrigir downloads concedendo acesso à pasta de download
ru: Исправлены загрузки, предоставив доступ к папке загрузок
uk: Виправити завантаження, надавши доступ до каталогу завантажень

source: Improve download progress handling
bg: Подобрена е обработката на напредък на изтеглянето
fr: Amélioration de la gestion de la progression des téléchargements
hi: बेहतर डाउनलोड प्रगति प्रबंधन
it: Migliora gestione del progresso degli scaricamenti
pt_br: Melhorar o download de manuseio de progresso
ru: Улучшена обработка хода загрузки
uk: Поліпшити обробку прогресу завантаження

source: Show close button on small window sizes
bg: Показване на бутон за затваряне при малки размери на прозореца
fr: Affichage d’un bouton Fermer sur les écrans de petite taille
hi: छोटे आकार की खिड़की पर बंद करने का बटन दिखाता है
it: Mostra pulsante di chiusura su finestre piccole
pt_br: Mostre o botão Fechar em pequenos tamanhos de janela
ru: Отображение кнопки закрытия окна небольшого размера
uk: Показувати кнопку закриття при малому розмірі вікна

source: This is the first working flatpak release. Some features (colors, caching) are missing.
bg: Това е първото работещо flatpak издание. Липсват някои функции (цветове, кеширане).
fr: Ceci est la première version flatpak fonctionnelle. Certaines fonctionnalités (couleurs, mise en cache) sont manquantes.
hi: यह पहली कार्यशील flatpak रिलीज़ है। कुछ सुविधाएं (रंग, कैशिंग) गायब हैं।
it: Questa è la prima release flatpak funzionante. Alcune caratteristiche (colori, caching) sono mancanti.
pt_br: Este é o primeiro lançamento de FlatPak que trabalha. Alguns recursos (cores, armazenamento em cache) estão faltando.
ru: Это первый рабочий релиз flatpak. Некоторые функции (цвета, кэширование) отсутствуют.
uk: Це перший працездатний flatpak-випуск. Деяких функцій (кольори, кешування) ще не вистачає.

source: First release on flathub! You get all the most important features
bg: Първо издание на flathub! Получавате всички най-важни функции
fr: Première version sur Flathub ! Vous avez accès à toutes les fonctionnalités essentielles
hi: Flathub पर पहली रिलीज़! आपको सभी सबसे महत्वपूर्ण सुविधाएं मिलती हैं
it: Prima release su flathub! Ottieni tutte le caratteristiche più importanti
pt_br: Primeiro lançamento no Flathub! Você obtém todos os recursos mais importantes
ru: Первый релиз на flathub! Вы получите все самые важные функции
uk: Перший випуск на flathub! Ви отримаєте всі найважливіші функції

source: colors
bg: цветове
fr: couleurs
hi: रंग
it: colori
pt_br: cores
ru: цвета
uk: кольори

source: caching
bg: кеширане
fr: mise en cache
hi: कैशिंग
pt_br: cache
ru: кэширование
uk: кешування

source: search
bg: търсене
fr: recherche
hi: खोजें
it: ricerca
pt_br: procurar
ru: поиск
uk: пошук

source: Geopard
bg: Гепард
pt_br: Geopardo
