Repository: ranfdev/Geopard
Catalog: po/*.po
Languages: bg, fr, hi, it, pt_br, ru, uk

# shortcut window
source: General
bg: Общи
fr: Général
hi: सामान्य
it: Generale
pt_br: Em geral
ru: Основное
uk: Загальне

# shortcut window
source: Shortcuts
bg: Клавишни комбинации
fr: Raccourcis
hi: शॉर्टकट
it: Scorciatoie
pt_br: Atalhos
ru: Комбинации клавиш
uk: Скорочення

# shortcut window
source: Tabs
bg: Подпрозорци
fr: Onglets
hi: टैब
it: Schede
pt_br: Guias
ru: Вкладки
uk: Вкладки

# shortcut window
source: Open New Tab
bg: Отваряне на нов подпрозорец
fr: Ouvrir un nouvel onglet
hi: नई टैब खोलें
it: Apri Nuova Scheda
pt_br: Abra a nova guia
ru: Открыть новую вкладку
uk: Відкрити нову вкладку

# shortcut window
source: Close Current Tab
bg: Затваряне на подпрозорец
fr: Fermer l’onglet actuel
hi: मौजूदा टैब बंद करें
it: Chiudi Scheda Corrente
pt_br: Fechar a guia atual
ru: Закрыть текущую вкладку
uk: Закрити поточну вкладку

# shortcut window
source: Go to Nth Tab
bg: Към N-ти подпрозорец
fr: Aller au énième onglet
hi: Nवें टैब पर जाएं
it: Vai a scheda #N
pt_br: Vá para a enésima guia
ru: Перейти на N-ю вкладку
uk: Перейти до вкладки за номером

# shortcut window
source: View Open Tabs
bg: Преглед на отворените подпрозорци
hi: खुले टैब देखें
it: Mostra Schede Aperte
pt_br: Visualize as guias Abrir
uk: Переглянути відкриті вкладки

# shortcut window
source: Navigation
bg: Навигация
hi: पथ-प्रदर्शन
it: Navigazione
pt_br: Navegação
ru: Навигация
uk: Навігація

# shortcut window
source: Previous Page
bg: Назад към предишната страница
fr: Page précédente
hi: पिछला पृष्ठ
it: Pagina Precedente
pt_br: Página anterior
ru: Предыдущая страница
uk: Попередня сторінка

# shortcut window
source: Next Page
bg: Напред към следващата страница
fr: Page suivante
hi: अगला पृष्ठ
it: Pagina Successiva
pt_br: Próxima página
ru: Следующая страница
uk: Наступна сторінка

# shortcut window
source: Reload Page
bg: Презареждане на страницата
fr: Recharger la page
hi: पृष्ठ पुनः लोड करें
it: Ricarica Pagina
pt_br: Recarregar a página
ru: Обновить страницу
uk: Перезавантажити сторінку

# shortcut window
source: Focus Url Bar
bg: Фокусиране на лентата за адреси
fr: Focus sur la barre d’adresse
hi: URL पट्टी केंद्रित करें
it: Focus Barra URL
pt_br: Foco URL Bar
ru: Выделить панель Url
uk: Перейти до рядка адреси

# shortcut window
source: Bookmarks
bg: Отметки
fr: Signets
hi: बुकमार्क
it: Segnalibri
pt_br: Marcadores
ru: Закладки
uk: Закладки

# shortcut window
source: Bookmark Current Page
bg: Отметка за текущата страница
fr: Ajouter la page actuelle aux signets
hi: वर्तमान पृष्ठ को बुकमार्क करें
it: Segnalibro su Pagina Corrente
pt_br: Página atual de favoritos
ru: Добавить текущую страницу в закладки
uk: Додати поточну сторінку в закладки

# shortcut window
source: Show All Bookmarks
bg: Показване на всички отметки
fr: Afficher tous les signets
hi: सभी बुकमार्क दिखाएं
it: Mostra Tutti i Segnalibri
pt_br: Mostre todos os favoritos
ru: Показать все закладки
uk: Показати всі закладки

# shortcut window
source: Zoom
bg: Мащабиране
hi: जूम
it: Ingrandimento
ru: Увеличение
uk: Масштаб

# shortcut window
source: Zoom In
bg: Увеличаване
fr: Zoomer
hi: जूम इन
it: Ingrandisci
pt_br: Zoom entre
ru: Увеличить
uk: Наблизити

# shortcut window
source: Zoom Out
bg: Намаляване
fr: Dézoomer
hi: जूम आउट
it: Riduci
pt_br: Amplie o zoom
ru: Уменьшить
uk: Віддалити

# shortcut window
source: Reset Zoom
bg: Нормален мащаб
fr: Réinitialiser le zoom
hi: जूम रीसेट करें
it: Reimposta Ingrandimento
pt_br: Redefina o zoom
ru: Сбросить масштаб
uk: Скасувати масштаб

source: Go Back Right-click to show history
bg: Назад Натиснете с десния бутон на мишката, за да покажете историята
hi: पीछे जाएं इतिहास दिखाने के लिए दायां-क्लिक करें
it: Vai Indietro Click destro per mostrare la cronologia
pt_br: Volte Clique com o botão direito do mouse para mostrar a história
uk: Перейти назад Щоб переглянути історію, натисніть правою

source: Go Forward Right-click to show history
bg: Напред Натиснете с десния бутон на мишката, за да покажете историята
hi: आगे जाएं इतिहास दिखाने के लिए दायां-क्लिक करें
it: Vai Avanti Click destro per mostrare la cronologia
pt_br: Vá em frente Clique com o botão direito do mouse para mostrar a história
uk: Перейти вперед Щоб переглянути історію, натисніть правою

source: Reload
bg: Презареждане
hi: पुनः लोड करें
it: Ricarica
pt_br: Recarregar
uk: Перезавантажити

source: New Tab
bg: Нов подпрозорец
hi: नई टैब
it: Nuova Scheda
pt_br: Nova guia
uk: Нова вкладка

source: Enter Gemini address or search with Geminispace
bg: Въведете Gemini адрес или търсете с Geminispace
fr: Entrez une adresse Gemini ou recherchez avec Geminispace
hi: Gemini पता दर्ज करें या Geminispace से खोजें
it: Inserisci indirizzo Gemini o cerca con Geminispace
pt_br: Digite o endereço de Gemini ou pesquise com o GEMINISPACE
ru: Введите адрес Gemini или ищите с Geminispace
uk: Введіть адресу Gemini чи пошуковий запит Geminispace

source: Main Menu
bg: Основно меню
hi: मुख्य मेनू
it: Menu Principale
pt_br: Jogar o menu
uk: Головне меню

source: View Open Tabs
bg: Преглед на отворените подпрозорци
hi: खुले टैब देखें
it: Mostra Schede Aperte
pt_br: Visualize as guias Abrir
uk: Переглянути відкриті вкладки

source: Start Searching
bg: Започнете да търсите
hi: खोजना प्रारंभ करें
it: Inizia Ricerca
pt_br: Comece a pesquisar
uk: Почати пошук

source: All Bookmarks
uk: Усі закладки

source: Add Bookmark
uk: Додати закладку

source: Keyboard Shortcuts
uk: Клавіатурні скорочення

source: About Geopard
uk: Про Geopard

source: A GTK 4 Gemini browser written in Rust
bg: GTK 4 Gemini браузър, написан на Rust
fr: A navigateur Gemini GTK 4 codé avec Rust
hi: एक GTK 4 Gemini ब्राउज़र Rust में लिखा गया है
it: Un browser GTK 4 per Gemini scritto in Rust
pt_br: Um navegador GTK 4 Gemini escrito em ferrugem
ru: GTK 4 браузер Gemini написанный на Rust
uk: Переглядач Gemini на основі GTK 4, написаний на Rust

source: Gnome;GTK;browser;gemini;rust;
bg: браузър;уеб;страница;сайт;
fr: Gnome;GTK;navigateur;gemini;rust;
hi: Gnome;GTK;ब्राउज़र;gemini;rust;
pt_br: Gnome; gtk; navegador; gêmeos; ferrugem;
ru: Gnome;GTK;браузер;gemini;rust;
uk: Gnome;GTK;браузер;переглядач;gemini;rust;

source: Window width
bg: Широчина на прозореца
fr: Largeur de la fenêtre
hi: खिड़की चौड़ाई
it: Larghezza della finestrs
pt_br: Largura da janela
ru: Ширина окна
uk: Ширина вікна

source: Window height
bg: Височина на прозореца
fr: Hauteur de la fenêtre
hi: खिड़की ऊंचाई
it: Altezza della finestra
pt_br: Altura da janela
ru: Высота окна
uk: Висота вікна

source: Window maximized state
bg: Максимизирано състояние на прозорец
fr: État maximisé de la fenêtre
hi: खिड़की अधिकतमीकृत अवस्था
it: Stato della finestra massimizzato
pt_br: Estado maximizado da janela
ru: Состояние развернутого окна
uk: Розгорнутість вікна

source: Zoom
bg: Мащаб
hi: जूम
it: Ingrandimento
ru: Масштаб
uk: Масштаб

source: Browse Gemini pages
bg: Сърфиране на Gemini страници
hi: Gemini पृष्ठ ब्राउज़ करें
it: Naviga nelle pagine Gemini
pt_br: Navegue por páginas de Gêmeos
uk: Переглядайте сторінки Gemini

source: Geopard is a browser for the Gemini protocol, that is, a lighter alternative to the web. Use Geopard to browse the space and reach hundreds of Gemini capsules! Read stories, download files, play games...
bg: „Гепард“ е браузър за протокола Gemini, т.е. по-лека алтернатива на Интернет. Използвайте „Гепард“, за да сърфирате пространството и да достигнете до стотици Gemini капсули! Четете истории, теглете файлове, играйте игри…
hi: Geopard Gemini प्रोटोकॉल के लिए एक ब्राउज़र है, यानी वेब का एक हल्का विकल्प है। अंतरिक्ष को ब्राउज़ करने और सैकड़ों Gemini कैप्सूल तक पहुंचने के लिए Geopard का उपयोग करें! कहानियां पढ़ें, फाइलें डाउनलोड करें, गेम खेलें...
it: Geopard è un browser per il protocollo Gemini, che è un'alternativa più leggera al web. Usa Geopard per navigare questo spazio e raggiungere centinaia di capsule Gemini! Leggi storie, scarica file, gioca...
pt_br: Geopard é um navegador para o protocolo Gemini, ou seja, uma alternativa mais leve à web. Use Geopard para navegar no espaço e atingir centenas de cápsulas de Gêmeos! Leia histórias, baixe arquivos, jogue jogos ...
uk: Geopard — переглядач для протоколу Gemini, легшої альтернативи вебу. За допомогою Geopard ви можете переглядати простір і досягати сотень Gemini-капсул! Читайте історії, завантажуйте файли, грайте в ігри…

source: Features:
bg: Функции:
hi: विशेषताएं:
it: Caratteristiche:
pt_br: Característicos:
uk: Можливості:

source: Colors! The browser will have a different color for each domain you visit.
bg: Цветове! Браузърът ще има различен цвят за всеки домейн, който посещавате.
fr: Des couleurs ! Le navigateur changera de couleur selon le domaine que vous visitez.
hi: रंग! आपके द्वारा देखे जाने वाले प्रत्येक डोमेन के लिए ब्राउज़र का रंग अलग होगा।
it: Colori! Il browser avrà un colore differente per ogni dominio che visiti.
pt_br: Cores! O navegador terá uma cor diferente para cada domínio que você visita.
ru: Цвета! Браузер будет иметь разные цвета для каждого посещаемого вами домена.
uk: Кольори! Переглядач позначатиме кожен відвіданий домен інакшим кольором.

source: Fast (async core + caching): Streams content by default. That means you can open pages even when you have connection speeds of Kb/s. It also caches pages in the history, so you can go back/forward in an instant
bg: Бързо (асинхронно ядро + кеширане): Предава съдържание по подразбиране. Това означава, че може да отваряте страници, дори когато скоростта на връзката ви е в Kb/s. Освен това кешира страниците в историята, така че може мигновенно да се връщате назад/напред
hi: तेज (अतुल्यकालिक कोर + कैशिंग): तयशुदा रूप से सामग्री स्ट्रीम करता है। इसका मतलब है कि आप Kb/s की कनेक्शन गति होने पर भी पृष्ठ खोल सकते हैं। यह इतिहास के पृष्ठों को भी कैशे करता है, जिससे आप तुरंत पीछे/आगे जा सकते हैं
it: Rapido (async core + caching): fa lo streaming del contenuto in modo predefinito. Questo significa che puoi aprire le pagine anche su connessioni lente. Inoltre memorizza le pagine nella cronologia, così puoi andare indietro/avanti in un istante
pt_br: Fast (núcleo assíncrono + cache): transmite o conteúdo por padrão. Isso significa que você pode abrir páginas mesmo quando tiver velocidades de conexão de KB/s. Ele também armazena em cache as páginas da história, para que você possa voltar/avançar em um instante
uk: Швидкість (асинхронне ядро й кешування). Типово показує вміст по мірі завантаження. Тобто ви можете відкривати сторінки, навіть коли швидкість з'єднання — лічені кілобайти. Він також кешує сторінки в історії, тож ви можете миттєво переходити вперед і назад.

source: Can download binary files: The download will start as soon as you open the corresponding link. You can always cancel it by opening another page.
bg: Способност заизтегляне на двоични файлове: Изтеглянето ще започне веднага щом отворите съответната връзка. Винаги може да го отмените, като отворите друга страница.
hi: बाइनरी फाइलें डाउनलोड कर सकते हैं: जैसे ही आप संबंधित लिंक खोलेंगे, डाउनलोड शुरू हो जाएगा। आप दूसरा पृष्ठ खोलकर इसे कभी भी रद्द कर सकते हैं।
it: Può scaricare file binari: Lo scaricamento inizierà appena apri il link corrispondente. Puoi sempre annullarlo aprendo un nuova pagina.
pt_br: Pode baixar arquivos binários: o download começará assim que você abrir o link correspondente. Você sempre pode cancelá -lo abrindo outra página.
uk: Може завантажувати двійкові файли. Завантаження почнеться, щойно ви перейдете за відповідним посиланням. Ви завжди можете скасувати його, відкривши іншу сторінку.

source: Updated to latest libadwaita and GTK to improve performance and compatibility, including the use of the new Adw.Dialog and Adw.Breakpoint widgets.
bg: Програмата е обновена с най-новите версии на libadwaita и GTK, за да се подобри производителността и съвместимостта, включително използването на новите графични обекти Adw.Dialog и Adw.Breakpoint.
hi: नए Adw.Dialog और Adw.Breakpoint विजेट के उपयोग सहित प्रदर्शन और अनुकूलता को बेहतर बनाने के लिए नवीनतम libadwaita और GTK में अद्यतित किया गया।
it: Aggiornato all'ultima libadwaita e GTK per migliorare prestazioni e compatibilità, incluso l'utilizzo dei nuovi widget Adw.Dialog e Adw.Breakpoint.
pt_br: Atualizado para o mais recente Libadwaita e GTK para melhorar o desempenho e a compatibilidade, incluindo o uso dos widgets ADW.Dialog e Adw.breakpoint.
uk: Оновлено до найновіших версій libadwaita й GTK, щоб поліпшити швидкодію й сумісність. Зокрема використано нові віджети Adw.Dialog і Adw.Breakpoint.

source: Improved security by adding TOFU (Trust On First Use) website verification
bg: Сигурността е подобрена чрез добавянето на TOFU (Trust On First Use) потвърждаване на уебсайтове
hi: TOFU (ट्रस्ट ऑन फर्स्ट यूज़) वेबसाइट सत्यापन को जोड़कर सुरक्षा में सुधार हुआ
it: Sicurezza migliorata grazie all'aggiunta della verifica dei siti web TOFU (Trust On First Use)
pt_br: Segurança aprimorada, adicionando verificação do site TOFU (Trust no primeiro uso)
uk: Поліпшено безпеку шляхом додання TOFU-перевірки вебсайтів — довіри при першому використанні.

source: Some native pages ("input" page and "open link in external browser" page) were persisting as overlay after opening a new link. Now the page navigation is fixed.
bg: Някои системни страници („въвеждане“ и „отваряне на връзка във външен браузър“) се запазваха като слои след отваряне на нова връзка. Сега навигацията на страниците е поправена.
hi: कुछ मूल पृष्ठ ("आगत" पृष्ठ और "बाहरी ब्राउज़र में लिंक खोलें" पृष्ठ) एक नया लिंक खोलने के बाद उपरिशायी के रूप में बने हुए थे। अब पृष्ठ पथ-प्रदर्शन ठीक हो गया है।
it: Alcune pagine native (pagine "input" e "open link in external browser") persistevano come overlay dopo aver aperto un link. Adesso la navigazione è corretta.
pt_br: Algumas páginas nativas (página "entrada" e "Link aberto no navegador externo") estavam persistindo como sobreposição após a abertura de um novo link. Agora a navegação da página está corrigida.
uk: Деякі «рідні» сторінки (введення й відкриття в зовнішньому переглядачі) залишалися накладеними після відкриття нового посилання. Тепер перехід між сторінками виправлено.

source: Many other small fixes and improvements.
bg: Много други малки поправки и подобрения.
hi: कई अन्य छोटे सुधार और उन्नति।
it: Tanti altre piccole correzioni e miglioramenti.
pt_br: Muitas outras pequenas correções e melhorias.
uk: Багато інших дрібних виправлень і вдосконалень.

source: Updated to latest libadwaita and GTK to improve performance and compatibility, including the use of the new Adw.TabOverview widget for improved tab management on small screens.
bg: Програмата е обновена с най-новите версии на libadwaita и GTK, за да се подобри производителността и съвместимостта, включително използването на новия графичен обект Adw.TabOverview за по-добро управление на подпрозорците на малки екрани.
hi: छोटे स्क्रीन पर बेहतर टैब प्रबंधन के लिए नए Adw.TabOverview विजेट के उपयोग सहित प्रदर्शन और अनुकूलता में सुधार के लिए नवीनतम libadwaita और GTK में अद्यतित किया गया।
it: Aggiornato all'ultima libadwaita e GTK per migliorare prestazioni e compatibilità, incluso l'utilizzo dei nuovi widget Adw.Dialog e Adw.Breakpoint.
pt_br: Atualizado para o mais recente Libadwaita e GTK para melhorar o desempenho e a compatibilidade, incluindo o uso do novo widget Adw.taboverview para melhorar o gerenciamento de guias em telas pequenas.
uk: Оновлено до найновіших версій libadwaita й GTK, щоб поліпшити швидкодію й сумісність. Зокрема використано новий віджет Adw.TabOverview, щоб зручніше керувати вкладками на малих екранах.

source: Added support for opening files and gemini mime types from the command line.
bg: Добавена е способност за отваряне на файлове и gemini mime видове от командния ред.
hi: कमांड लाइन से फाइलें और जेमिनी माइम प्रकार खोलने के लिए समर्थन जोड़ा गया।
it: Aggiunto supporto per aprire file e tipi MIME di Gemini dalla linea di comando.
pt_br: Adicionado suporte para abrir arquivos e tipos de MIME Gemini na linha de comando.
uk: Додано підтримку відкриття файлів і mime-типів gemini з командного рядка.

source: Added tab history menu on right click over arrows for easier navigation.
bg: Добавена е способност за виждане на историята при натискане с десния бутон на мишката върху стрелките за по—лесна навигация.
hi: आसान पथ-प्रदर्शन के लिए तीरों पर दायें क्लिक पर टैब इतिहास मेनू जोड़ा गया।
it: Aggiunto sulle frecce un menu contestuale con la cronologia per una navigazione facilitata.
pt_br: Adicionado menu Histórico da guia No botão direito do clique em Over Arrows para facilitar a navegação.
uk: Додано історію вкладок при натиску правою по стрілці, щоб було зручніше пересуватися.

source: Fixed issue with links without whitespace not working properly.
bg: Поправен е проблемът С връзките без празни знаци, които не работят правилно.
hi: रिक्त स्थान के बिना लिंक के ठीक से काम न करने की समस्या का समाधान किया गया।
it: Risolto problema con i link privi di spazi bianchi che non funzionavano a dovere.
pt_br: Corrigido o problema com links sem espaço em branco não funcionando corretamente.
uk: Виправлено проблему з некоректною роботою посилань без пробілів.

source: Moved scrollbar to the edge of the window for a cleaner UI.
bg: Преместена е лентата за придвижване към ръба на прозореца, за да бъде по-изчистен потребителския интерфейс.
hi: साफ UI के लिए स्क्रॉलपट्टी को खिड़की के किनारे पर ले जाया गया।
it: Spostata la barra di scorrimento a bordo finestra per una UI più pulita.
pt_br: Moveu a barra de rolagem para a borda da janela para uma interface do usuário mais limpa.
uk: Посунуто смугу прокручування до краю вікна, щоб інтерфейс виглядав чистіше.

source: Added tooltips for items in header bar to provide more information to users.
bg: Добавени са подсказки за елементите в заглавната лента, за да се предостави повече информация на потребителите.
hi: उपयोक्ताओं को अधिक जानकारी प्रदान करने के लिए शीर्षलेख-पट्टी में वस्तुओं के लिए टूलटिप्स जोड़े गए।
it: Aggiunti tooltip per gli oggetti nella barra superiore per dare più informazioni agli utenti.
pt_br: Adicionado dicas de ferramentas para itens na barra de cabeçalho para fornecer mais informações aos usuários.
uk: Додано спливні підказки для елементів шапки, щоб надавати більше інформації про використання.

source: Added more information to the About window to give users a better idea of the project's.
bg: Добавена е повече информация в „Относно“ прозореца, за да могат потребителите да получат по-добра представа за проекта.
hi: उपयोक्ताओं को परियोजना के बारे में बेहतर जानकारी देने के लिए "बारे में" खिड़की में अधिक जानकारी जोड़ी गई।
it: Aggiunte più informazioni alla finestra Informazioni per dare agli utenti una panoramica del progetto.
pt_br: Adicionado mais informações à janela sobre a janela para oferecer aos usuários uma idéia melhor do projeto.
uk: Додано більше інформації у вікно «Про Geopard», щоб докладніше описати ідею проєкту.

source: Various fixes and refactorings.
bg: Различни поправки и преработка на кода.
hi: विभिन्न सुधार और पुनर्रचना।
it: Fix e refactoring vari.
pt_br: Várias correções e refatores.
uk: Різні виправлення й рефакторинг.

source: Added ability to reload the current page
bg: Добавена е способност за презареждане на текущата страница
fr: Ajout de la possibilité de recharger la page actuelle
hi: वर्तमान पृष्ठ को पुनः लोड करने की क्षमता जोड़ी गई
it: Aggiunta possibilità di ricaricare la pagina corrente
pt_br: Capacidade adicionada para recarregar a página atual
ru: Добавлена возможность обновления текущей страницы
uk: Додано можливість перезавантажити поточну сторінку

source: Nicer list items formatting
bg: По-хубаво форматиране на елементите от списъци
fr: Meilleur formatage des listes d’éléments
hi: बेहतर सूची वस्तुएं स्वरूपण
it: Formattazione migliorata degli elementi di lista
pt_br: Itens de lista mais agradável formatação
ru: Лучше форматирование элементов списка
uk: Охайніше форматування елементів переліку

source: Fixed annoying bug where selecting the text would sometimes transform a paragraph into a title, temporarily
bg: Поправена е досадна грешка, при която избирането на текст понякога преобразува даден абзац в заглавие, временно.
fr: Correction d’un bogue ennuyeux où la sélection du texte transformait parfois brièvement un paragraphe en titre
hi: कष्टप्रद बग को ठीक किया गया जहां पाठ का चयन कभी-कभी अस्थायी रूप से एक अनुच्छेद को शीर्षक में बदल देता था
it: Risolto bug fastidioso che corrompeva la selezione del testo trasformando talvolta i paragrafi in titoli, temporaneamente
pt_br: Corrigido o bug irritante ao se selecionar o texto às vezes transformava um parágrafo em um título, temporariamente
ru: Исправлена раздражающая ошибка, при которой выделение текста иногда превращало абзац в заголовок, временно
uk: Виправлено дратівливу ваду, коли виділення тексту часом тимчасово перетворювало абзац на заголовок

source: Fixed crash when the app theme is overridden
bg: Поправена е програмата да не забива, когато темата на програмата е заменена
fr: Correction d’un plantage quand le thème de l’application est supplanté
hi: ऐप थीम अध्यारोहण होने पर क्रैश को ठीक किया गया
it: Risolto crash durante l'override del tema dell'app
pt_br: Falha fixa quando o tema do aplicativo é substituído
ru: Исправлена ошибка при переопределении темы приложения
uk: Виправлено збій при заміщенні теми програми

source: Fixed unresponsiveness when a big page is loading
bg: Поправена е програмата да не забива, когато голяма страница се зарежда
fr: Correction de l’absence de réponse lors du chargement d’une page volumineuse
hi: जब कोई बड़ा पृष्ठ लोड हो रहा हो तो अनुत्तरदायीता को ठीक किया गया
it: Risolta mancata reattività durante il caricamento di pagine grosse
pt_br: Fixo não responsividade quando uma grande página está carregando
ru: Исправлена неотзывчивость при загрузке большой страницы
uk: Виправлено зависання при завантаженні великої сторінки

source: Complete rewrite of the gemini parser to make it more robust and improve handling of edge cases
bg: Пълно пренаписване на gemini анализатора, за да стане по-стабилен и да се подобри работата с отделни случаи
fr: Réécriture complète de l’analyseur Gemini pour le rendre plus robuste et améliorer la gestion des cas limites
hi: जेमिनी विश्लेषक को अधिक मजबूत बनाने और किनारे के मामलों की संचालन में सुधार करने के लिए इसे फिर से लिखा गया
it: Riscrittura completa del parser gemini per migliorarne robustezza e gestione dei casi limite
pt_br: Reescrita completa do analisador Gemini para torná -lo mais robusto e melhorar o manuseio de casos de borda
ru: Полная перепись парсера gemini, чтобы сделать его более надежным и улучшить обработку крайних случаев
uk: Повністю переписано gemini-парсер, щоб він працював точніше й обробляв крайні випадки

source: Added more shortcuts
bg: Добавени са повече клавишни комбинации
fr: Ajout de plus de raccourcis
hi: अधिक शॉर्टकट जोड़े गए
it: Aggiunte ulteriori scorciatoie
pt_br: Adicionado mais atalhos
ru: Добавлено больше комбинаций клавиш
uk: Додано більше скорочень

source: There's now a status bar showing the URL of hovered links
bg: Вече има лента на състоянието, в която се показва адресът на връзките, върху които е надвесена мишката
fr: Une barre d’état affiche désormais l’URL des liens survolés
hi: अब यहां एक स्थिति पट्टी है जो मंडराए गए लिंक का URL दिखाता है
it: Adesso abbiamo una barra di stato che mostra l'URL dei link sotto il cursore
pt_br: Agora há uma barra de status mostrando o URL de links pairados
ru: Теперь в строке состояния отображается URL наведенных ссылок
uk: Тепер є рядок стану, який показує URL-адресу посилання, на яке ви навели

source: Various code refactorings
bg: Различни преработки на кода
fr: Diverses refontes du code
hi: विभिन्न कोड पुनर्रचना
it: Refactoring vari
pt_br: Vários refatores de código
ru: Различные улучшения кода
uk: Різний рефакторинг коду
